from selenium import webdriver

class BrowserNavigator:

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	# Глобальные настройки.
	__Settings = dict()
	# Экземпляр браузера.
	__Browser = None

	#==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#
	
	# Конструктор: задаёт глобальные настройки и экземпляр браузера.
	def __init__(self, Settings: dict, Browser: webdriver.Chrome):

		#---> Генерация свойств.
		#==========================================================================================#
		self.__Settings = Settings
		self.__Browser = Browser

	# Возвращает HTML код тела страницы после полной загрузки.
	def GetPageHTML(self) -> str:
		# HTML код тела страницы после полной загрузки.
		PageHTML = str(self.__Browser.execute_script("return document.body.innerHTML;"))

		return PageHTML

	# Выполняет переход на указанную страницу.
	def LoadPage(self, URL: str):
		# Переход по URL страницы.
		self.__Browser.get(URL)